benchmark_result/bench_result_hadware_evol/fio/xen_4_11_1_3/vm6/fio_result/round16/rand_write_throughput
rand_write_throughput: (g=0): rw=randwrite, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.1
Starting 4 processes

rand_write_throughput: (groupid=0, jobs=4): err= 0: pid=17203: Sat Jun  1 20:16:25 2024
  write: IOPS=508, BW=513MiB/s (538MB/s)(30.3GiB/60435msec)
    slat (usec): min=240, max=3931.0k, avg=7835.37, stdev=123812.09
    clat (msec): min=6, max=4366, avg=492.00, stdev=994.79
     lat (msec): min=64, max=4368, avg=499.80, stdev=1001.94
    clat percentiles (msec):
     |  1.00th=[   82],  5.00th=[   95], 10.00th=[  102], 20.00th=[  115],
     | 30.00th=[  130], 40.00th=[  146], 50.00th=[  165], 60.00th=[  186],
     | 70.00th=[  215], 80.00th=[  253], 90.00th=[  397], 95.00th=[ 3473],
     | 99.00th=[ 4111], 99.50th=[ 4329], 99.90th=[ 4329], 99.95th=[ 4329],
     | 99.99th=[ 4329]
   bw (  KiB/s): min= 2048, max=646412, per=48.51%, avg=254853.87, stdev=184926.33, samples=248
   iops        : min=    2, max=  631, avg=248.57, stdev=180.50, samples=248
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=8.97%, 250=70.85%
  lat (msec)   : 500=11.15%, >=2000=9.83%
  cpu          : usr=1.64%, sys=3.14%, ctx=54740, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=0.4%, >=64=109.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,30748,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=513MiB/s (538MB/s), 513MiB/s-513MiB/s (538MB/s-538MB/s), io=30.3GiB (32.5GB), run=60435-60435msec

Disk stats (read/write):
  xvda: ios=0/270439, merge=0/20, ticks=0/3665376, in_queue=1551048, util=41.27%